Tekla Open API Reference for Tekla Structures 2025
AnalysisBar.CardinalPointEnum Enumeration
 The cardinal point types of the analysis bar.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CardinalPointEnum
Public Enumeration CardinalPointEnum
Members
Member name | Value | Description
CARDINAL_POINT_CENTROID | 0 |  The cardinal point is centroid.
CARDINAL_POINT_TOP_LEFT | 1 |  The cardinal point is top left.
CARDINAL_POINT_TOP_CENTER | 2 |  The cardinal point is top center.
CARDINAL_POINT_TOP_RIGHT | 3 |  The cardinal point is top right.
CARDINAL_POINT_MIDDLE_LEFT | 4 |  The cardinal point is middle left.
CARDINAL_POINT_MIDDLE_CENTER | 5 |  The cardinal point is middle center.
CARDINAL_POINT_MIDDLE_RIGHT | 6 |  The cardinal point is middle right.
CARDINAL_POINT_BOTTOM_LEFT | 7 |  The cardinal point is bottom left.
CARDINAL_POINT_BOTTOM_CENTER | 8 |  The cardinal point is bottom center.
CARDINAL_POINT_BOTTOM_RIGHT | 9 |  The cardinal point is bottom right.
See Also
Reference
Tekla.Structures.Analysis Namespace